src/cf/src/Documents/ТребованиеНакладная/ТребованиеНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТребованиеНакладная</name>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыНаСтанках</registerRecords>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТребованийНакладных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФакт</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалыОставлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьПриРазмещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СоСкладаСтанка</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Израсходовано</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/СтатусыТребованийНакладных/СтатусыТребованийНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТребованийНакладных</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Запущено</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ТребованиеНакладная/Forms/ФормаДокумента/Module.bsl
// Форма требования-накладной: строка продукции заказа, материалы, план и факт загрузки станка. Команды «Разместить»,
// «Запустить», «Завершить», «Отменить» ставят статус и проводят документ; «Вернуть в работу» - руководителю и
// администратору. Правила - общий модуль ТребованияНакладные.
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьФорму();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбновитьФорму();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьФорму();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтанокПриИзменении(Элемент)

	СтанокПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)

	Объект.КодСтрокиПродукции = 0;
	Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Объект.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	Объект.Материалы.Очистить();
	СтрокаПродукции = ПредставлениеСтроки(Объект.КодСтрокиПродукции);

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПродукцииНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Строки = СтрокиПродукцииЗаказа(Объект.Заказ);
	Если Строки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите заказ на производство со строками продукции и материалами';
			|fr = 'Choisissez une commande de production avec des lignes de produits et des matières';
			|en = 'Select a production order with product lines and materials';
			|es = 'Elija un pedido de producción con líneas de producto y materiales'"));
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтрокиПродукции", ЭтотОбъект);
	ПоказатьВыборИзСписка(Оповещение, Строки, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьМатериалы(Команда)

	Если Объект.КодСтрокиПродукции = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала выберите строку продукции заказа';
			|fr = 'Choisissez d''abord la ligne de produit de la commande';
			|en = 'Select the product line of the order first';
			|es = 'Primero elija la línea de producto del pedido'"));
		Возврат;
	КонецЕсли;
	ЗаполнитьПоСтрокеНаСервере(Объект.КодСтрокиПродукции);

КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)

	ВыполнитьДействие("Разместить");

КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)

	ВыполнитьДействие("Запустить");

КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)

	ВыполнитьДействие("Завершить");

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)

	ВыполнитьДействие("Отменить");

КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРаботу(Команда)

	Если ВернутьВРаботуНаСервере() Тогда
		Оповестить("Запись_ТребованиеНакладная", , Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораСтрокиПродукции(Выбранный, ДополнительныеПараметры) Экспорт

	Если Выбранный = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПоСтрокеНаСервере(Выбранный.Значение);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Действие)

	Если ВыполнитьДействиеНаСервере(Действие) Тогда
		Оповестить("Запись_ТребованиеНакладная", , Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьДействиеНаСервере(Знач Действие)

	Документ = РеквизитФормыВЗначение("Объект");
	Попытка
		ТребованияНакладные.ВыполнитьДействие(Документ, Действие);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Ложь;
	ОбновитьФорму();
	Возврат Истина;

КонецФункции

&НаСервере
Функция ВернутьВРаботуНаСервере()

	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Сначала запишите требование-накладную';
			|fr = 'Enregistrez d''abord le bon de consommation';
			|en = 'Save the requisition first';
			|es = 'Primero guarde el vale'"));
		Возврат Ложь;
	КонецЕсли;
	Попытка
		ТребованияНакладные.ВернутьВРаботу(Объект.Ссылка);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	ОбновитьФорму();
	Возврат Истина;

КонецФункции

&НаСервере
Процедура СтанокПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.Станок) Тогда
		Объект.Оператор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Станок, "Оператор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСтрокеНаСервере(Знач КодСтроки)

	Документы.ТребованиеНакладная.ЗаполнитьПоСтрокеЗаказа(Объект, Объект.Заказ, КодСтроки, Объект.Количество);
	СтрокаПродукции = ПредставлениеСтроки(КодСтроки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокиПродукцииЗаказа(Знач Заказ)

	Возврат ТребованияНакладные.СтрокиПродукцииЗаказа(Заказ);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтроки(КодСтроки)

	Если КодСтроки = 0 Тогда
		Возврат НСтр("ru = 'выбрать'; fr = 'choisir'; en = 'select'; es = 'elegir'");
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'строка с кодом %1'; fr = 'ligne de code %1'; en = 'line code %1'; es = 'línea de código %1'"),
		КодСтроки);

КонецФункции

// Выпуск по требованию, подпись строки продукции и доступность команд по статусу: завершённое и отменённое
// требование только просматривается.
//
&НаСервере
Процедура ОбновитьФорму()

	Статусы = Перечисления.СтатусыТребованийНакладных;
	Статус = Объект.Статус;
	Выпуск = ТребованияНакладные.ВыпускПоТребованию(Объект.Ссылка);
	СтрокаПродукции = ПредставлениеСтроки(Объект.КодСтрокиПродукции);
	Закрыто = Статус = Статусы.Завершено Или Статус = Статусы.Отменено;
	ТолькоПросмотр = Закрыто;
	Элементы.ФормаРазместить.Видимость = Не Закрыто И Статус <> Статусы.Запущено;
	Элементы.ФормаЗапустить.Видимость = Не Закрыто;
	Элементы.ФормаЗавершить.Видимость = Статус = Статусы.Запущено;
	Элементы.ФормаОтменить.Видимость = Не Закрыто И Не Объект.Ссылка.Пустая();
	Элементы.ФормаВернутьВРаботу.Видимость = Статус = Статусы.Завершено
		И ТребованияНакладные.МожноВозвращатьВРаботу();
	Элементы.ДатаОтмены.Видимость = Статус = Статусы.Отменено;
	Элементы.МатериалыОставлены.Видимость = Статус = Статусы.Отменено;

КонецПроцедуры

#КонецОбласти
